# MetallicpaintBaseColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MetallicPaint..::..MetallicpaintBaseColor Property
MetallicPaint Class See Also
---
The property labeled "Color" from the "MetallicPaint" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MetallicpaintBaseColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MetallicpaintBaseColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ MetallicpaintBaseColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace